In [1]:
# !pip install mysql-connector-python

In [2]:
import pandas as pd
import mysql.connector
import getpass,os

### Simplified Version of MySqlConnection Class Below

In [3]:
conn = mysql.connector.connect(host = '127.0.0.1',password = 'python_test',user = 'python_connection')

if conn.is_connected():
    print('Connection Established..........')
    
db_cursor = conn.cursor()
db_cursor.execute("select * from myhr.employees")
result = db_cursor.fetchall()
db_cursor.close()
conn.close()

Connection Established..........

In [12]:
column_list =[desc[0] for desc in  db_cursor.description]
print(column_list)
df = pd.DataFrame(result, columns=column_list)
df.head()

['employee_id', 'first_name', 'last_name', 'email', 'phone_number', 'hire_date', 'job_id', 'salary', 'manager_id', 'department_id']

,employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,manager_id,department_id
0,100,Steven,King,steven.king@sqltutorial.org,515.123.4567,1987-06-17,4,24000.00,NaN,9
1,101,Neena,Kochhar,neena.kochhar@sqltutorial.org,515.123.4568,1989-09-21,5,17000.00,100.0,9
2,102,Lex,De Haan,lex.de haan@sqltutorial.org,515.123.4569,1993-01-13,5,17000.00,100.0,9
3,103,Alexander,Hunold,alexander.hunold@sqltutorial.org,590.423.4567,1990-01-03,9,9000.00,102.0,6
4,104,Bruce,Ernst,bruce.ernst@sqltutorial.org,590.423.4568,1991-05-21,9,6000.00,103.0,6

## MySqlConnection Class

In [36]:
class MySqlConnection:
    def __init__ (self,host,user,password):
        self.host = host
        self.user = user
        self.password = password
        self.conn = None
    
    def connect(self):
        """Establish Mysql Connection.."""
        self.conn = mysql.connector.connect(
            host = self.host,
            user = self.user,
            password = self.password
        )
        if self.conn.is_connected():
            print('MySql Connection Established........\n')

            connection_detail = ['Select current_user()','select current_timestamp()']
            cursor = self.conn.cursor()
            for query in connection_detail:
                cursor.execute(query)
                records = cursor.fetchall()
                print(records[0][0])
            
    def query_and_df(self,query):
        """Get records from Mysql into the Dataframe"""
        cursor = self.conn.cursor()
        cursor.execute(query)
        records = cursor.fetchall()
        cursor.close()
        
        ## Returning DF for Records
        column_list =[desc[0] for desc in  cursor.description]
        df = pd.DataFrame(records, columns=column_list)
        return df
    
    def connection_close(self):
        if self.conn:
            self.conn.close()
            print('MySql Connection Closed.........\n')

## Class Object Instantion

In [37]:
## Class Object Instantion 

db_config = {
    "host":"localhost",
    "user":"python_connection",
    "password":getpass.getpass()    
}

mysql_conn = MySqlConnection(**db_config)
mysql_conn.connect()

 ········

MySql Connection Established........

python_connection@localhost
2024-04-05 14:09:53

In [35]:
## Quering MYSQL 

sql = "select * from myhr.employees"
df = mysql_conn.query_and_df(sql)
mysql_conn.connection_close()
df.head()

MySql Connection Closed.........

,employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,manager_id,department_id
0,100,Steven,King,steven.king@sqltutorial.org,515.123.4567,1987-06-17,4,24000.00,NaN,9
1,101,Neena,Kochhar,neena.kochhar@sqltutorial.org,515.123.4568,1989-09-21,5,17000.00,100.0,9
2,102,Lex,De Haan,lex.de haan@sqltutorial.org,515.123.4569,1993-01-13,5,17000.00,100.0,9
3,103,Alexander,Hunold,alexander.hunold@sqltutorial.org,590.423.4567,1990-01-03,9,9000.00,102.0,6
4,104,Bruce,Ernst,bruce.ernst@sqltutorial.org,590.423.4568,1991-05-21,9,6000.00,103.0,6